"""
Дан список чисел. Выведите значение наибольшего элемента в 
списке, а затем индекс этого элемента в списке. Если 
наибольших элементов несколько, выведите индекс первого из них.
"""

max1 = 0
a = [int(input(f"Введіть {i} елемент списку: ")) for i in range(int(input("Введіть кількість елементів списку: ")))]
# перший спосіб - самопісний спосіб
for i in range(0, len(a)):
    if a[i] > max1:
        max1 = a[i]
        j = i
print(max1, j, sep = ', ')

# другий спосіб - використовуючи стандартні функції
print(max(a), a.index(max(a)), sep = ', ') 


