"""
Дан список чисел. Выведите все элементы списка, 
которые больше предыдущего элемента. 
"""
a = [int(input(f"Введіть {i} елемент списку: ")) for i in range(int(input("Введіть кількість елементів списку: ")))]
for i in range(1, len(a)):
    if a[i] > a[i - 1]:
        print(a[i])
