"""Дана строка, состоящая из слов, разделенных пробелами. 
Определите, сколько в ней слов. Используйте для решения 
задачи метод count
"""
s = str(input("Input string: "))
print(f"Кількість пробілів: {s.count(' ')}")