"""
Определите количество четных элементов в последовательности, 
завершающейся числом 0. В этой и во всех следующих задачах 
числа, следующие за первым нулем, учитывать не нужно. 
"""

n = int(input("Введіть кількість чисел: "))

j = 1
i = 0
k = 0

while j <= n:
    n1 = int(input(f"Введіть {j} число: "))
    j += 1
    if n1 != 0 and i == 0: # якщо число не нуль і це перший випадок (перший нуль)
        if n1 % 2 == 0:
            k += 1 # рахуємо кількість парних чисел
    else:
        i += 1 # рахуємо всі інші нулі в послідовності
print(k) # виводимо кількість парних чисел
