"""
Дан список чисел. Выведите значение наибольшего элемента в 
списке, а затем индекс этого элемента в списке. Если 
наибольших элементов несколько, выведите индекс первого из них.
"""

a = [int(input(f"Введіть {i} елемент списку: ")) for i in range(int(input("Введіть кількість елементів списку: ")))]
max1 = a[0] # першій спосіб - самопісний
j = 0
for i in range(len(a)):
    if a[i] > max1:
        max1 = a[i]
        j = i
print(max1, j, sep= ', ')
#другий спосіб - з використанням стандартних методів пайтона
print(max(a), a.index(max(a)), sep = ', ') 
