"""
Выведите все элементы списка с четными 
индексами (то есть A[0], A[2], A[4], ...).
"""

a = []
#n = int(input("Введіть кількість елементів списку: "))

for i in range(int(input("Введіть кількість елементів списку: "))):
#    elem = int(input(f"Введіть {i} елемент списку: "))
    # додаємо елементи до списку
    a.append(int(input(f"Введіть {i} елемент списку: ")))
print(a[::2])