"""
Дан список из чисел и индекс элемента в списке k. 
Удалите из списка элемент с индексом k, сдвинув 
влево все элементы, стоящие правее элемента с индексом k.
Программа получает на вход список, затем число k. Программа 
сдвигает все элементы, а после этого удаляет последний элемент 
списка при помощи метода pop() без параметров.

Программа должна осуществлять сдвиг непосредственно в списке, 
а не делать это при выводе элементов. Также нельзя использовать 
дополнительный список. Также не следует использовать 
метод pop(k) с параметром. 
"""
a = [int(input(f"Введіть {i} елемент списку: ")) for i in range(int(input("Введіть кількість елементів списку: ")))]
k = int(input("k = "))
# інший масив створюємо виключно для того щоб показати в одному файлі два варіанти рішення
b = [i for i in a] 
k1 = 0
# режим паранойи :)
for i in range(len(a)-1):
    if i == k:
        k1 = a[i] # запам'ятувуємо елемент у якого індекс k
        a[i] = a[i+1] # зміщуємо елементи масиву
    elif i > k:
        a[i] = a[i+1]
a[len(a)-1] = k1 # останньому елементу масиву присвоюємо значення k1
# виводимо змінений масив з k1 в кінці
print(f"Зміщуємо масив: {a}", sep=', ')
a.pop() # видаяляємо останній елемент
print(f"Перший варіант рішення: {a}", sep=', ')

# короткий метод
for i in range(k, len(b) - 1):
    b[i] = b[i + 1]
b.pop()
print(f"Другий варіант рішення: {b}", sep = ', ')

    


