"""
Выведите все элементы списка с четными 
индексами (то есть A[0], A[2], A[4], ...).
"""

a = []
n = int(input("Введіть кількість елементів списку: "))

for i in range(n):
    elem = int(input(f"Введіть {i} елемент списку: "))
    a.append(elem) #додаємо елементи до списку
print(a[::2])