"""
Даны два числа n и m. Создайте двумерный массив размером n×m 
и заполните его символами "." и "*" в шахматном порядке. В левом 
верхнем углу должна стоять точка. 
"""

n = int(input("Введіть кількість строк (n): "))
m = int(input("Введіть кількість стовбців (m): "))
a = [['*'] * m for i in range(n)]

#a[0][0] = '*'
for i in range(n):
    for j in range(m):
        if (i+j)%2 == 0:
            a[i][j] = '.'
    
for line in a:
    print(' '.join(str(elem) for elem in line))